In [4]:
import pandasql as psql

In [5]:
##  Birth Data Set 
birth = psql.load_births()
birth.head()

        date  births
0 1975-01-01  265775
1 1975-02-01  241045
2 1975-03-01  268849
3 1975-04-01  247455
4 1975-05-01  254545

In [6]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

In [7]:
toydf = pd.read_csv(r'E:\toy_dataset.csv',header=0)

In [8]:
toydf.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [9]:
toydf.City.unique()

array(['Dallas', 'New York City', 'Los Angeles', 'Mountain View',
       'Boston', 'Washington D.C.', 'San Diego', 'Austin'], dtype=object)

In [10]:
toydf.Age.describe()

count    150000.000000
mean         44.950200
std          11.572486
min          25.000000
25%          35.000000
50%          45.000000
75%          55.000000
max          65.000000
Name: Age, dtype: float64

In [11]:
toydf.Income.describe()

count    150000.000000
mean      91252.798273
std       24989.500948
min        -654.000000
25%       80867.750000
50%       93655.000000
75%      104519.000000
max      177157.000000
Name: Income, dtype: float64

In [12]:
toydf.Illness.unique()

array(['No', 'Yes'], dtype=object)

### data selection

In [13]:
sdf =  psql.sqldf("select Age, Income from toydf")
sdf.head()

   Age   Income
0   41  40367.0
1   54  45084.0
2   42  52483.0
3   40  40941.0
4   46  50289.0

In [14]:
sdf =  psql.sqldf("select Age, Income from toydf")
sdf.head()

   Age   Income
0   41  40367.0
1   54  45084.0
2   42  52483.0
3   40  40941.0
4   46  50289.0

In [15]:
sdfc1 =  psql.sqldf("select Age, Income, City from toydf limit 5")
sdfc1.head()

   Age   Income    City
0   41  40367.0  Dallas
1   54  45084.0  Dallas
2   42  52483.0  Dallas
3   40  40941.0  Dallas
4   46  50289.0  Dallas

### Data Filtering : Wee need all the Rows where City is Dallas

In [16]:
dallasDf = psql.sqldf("select * from toydf where City ='Dallas'")

In [17]:
dallasDf.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [18]:
dallasDf1 = psql.sqldf("select * from toydf where City ='Dallas' limit 5")

In [19]:
dallasDf1

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [18]:
dallasDf1 = psql.sqldf("select * from toydf where City ='Dallas' and Age > 30 limit 5")

In [19]:
dallasDf1

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

### Data Aggregation

In [20]:
cdf = psql.sqldf("select count(*), City from toydf group by City")

In [21]:
cdf.head()

   count(*)           City
0     12292         Austin
1      8301         Boston
2     19707         Dallas
3     32173    Los Angeles
4     14219  Mountain View

In [22]:
## This query will return average age City wise
cdf1 = psql.sqldf("select avg(Age), City from toydf group by City")
cdf1.head()

    avg(Age)           City
0  44.651237         Austin
1  45.197807         Boston
2  45.058761         Dallas
3  44.994094    Los Angeles
4  44.992756  Mountain View

In [23]:
## This query will return average age and Income grouped on City and Gender
cdf2 = psql.sqldf("select avg(Age),avg(Income), City, Gender from toydf group by City, Gender")
cdf2.head()

    avg(Age)   avg(Income)    City  Gender
0  44.505478  84958.760631  Austin  Female
1  44.764876  94424.246272  Austin    Male
2  45.219112  85978.442530  Boston  Female
3  45.180549  96071.649368  Boston    Male
4  45.141987  39602.533142  Dallas  Female

### inner joins

In [24]:
importDf = pd.read_csv(r'E:\2018-2010_import.csv',header=0)
exportDf = pd.read_csv(r'E:\2018-2010_export.csv',header=0)
importDf.head()

,HSCode,Commodity,value,country,year
0,5,"PRODUCTS OF ANIMAL ORIGIN, NOT ELSEWHERE SPECI...",0.00,AFGHANISTAN TIS,2018
1,7,EDIBLE VEGETABLES AND CERTAIN ROOTS AND TUBERS.,12.38,AFGHANISTAN TIS,2018
2,8,EDIBLE FRUIT AND NUTS; PEEL OR CITRUS FRUIT OR...,268.60,AFGHANISTAN TIS,2018
3,9,"COFFEE, TEA, MATE AND SPICES.",35.48,AFGHANISTAN TIS,2018
4,11,PRODUCTS OF THE MILLING INDUSTRY; MALT; STARCH...,NaN,AFGHANISTAN TIS,2018

In [25]:
exportDf.head()

,HSCode,Commodity,value,country,year
0,2,MEAT AND EDIBLE MEAT OFFAL.,0.18,AFGHANISTAN TIS,2018
1,3,"FISH AND CRUSTACEANS, MOLLUSCS AND OTHER AQUAT...",0.00,AFGHANISTAN TIS,2018
2,4,DAIRY PRODUCE; BIRDS' EGGS; NATURAL HONEY; EDI...,12.48,AFGHANISTAN TIS,2018
3,6,LIVE TREES AND OTHER PLANTS; BULBS; ROOTS AND ...,0.00,AFGHANISTAN TIS,2018
4,7,EDIBLE VEGETABLES AND CERTAIN ROOTS AND TUBERS.,1.89,AFGHANISTAN TIS,2018

In [26]:
exportDf1 = psql.sqldf("select * from exportDf where HSCode <30")
importDf1 = psql.sqldf("select * from importDf where HSCode <30")

In [31]:
joinedData = psql.sqldf("select i.HSCode, i.value as importVal,e.value as exportVal , i.year from  importDf1 i inner join exportDf1 e on i.HSCode = e.HSCode LIMIT 10;")

In [32]:
joinedData.head()

   HSCode  importVal exportVal  year
0       5        0.0      None  2018
1       5        0.0      None  2018
2       5        0.0      None  2018
3       5        0.0      None  2018
4       5        0.0      None  2018